{
  "version": "2.5.0",
  "releaseDate": "2025-09-29T00:00:00Z",
  "sections": [
    {
      "title": "New Features",
      "type": "newFeatures",
      "items": [
        {
          "title": "AI-Powered Image Analysis (macOS 26+)",
          "description": "Revolutionary on-device AI analyzes your images to identify objects, scenes, text, colors, and quality—all processed locally with complete privacy. Smart tags, search, and organization powered by Vision and Core ML.",
          "isHighlighted": true
        },
        {
          "title": "Smart Search & Organization",
          "description": "Find images instantly with AI-powered search by detected content, text, colors, and scenes. Automatic categorization into smart collections makes organizing thousands of images effortless.",
          "isHighlighted": true
        },
        {
          "title": "Enhanced Accessibility with AI",
          "description": "AI-generated image descriptions provide rich, detailed VoiceOver experiences. Multi-language support and context-aware descriptions make images accessible to everyone.",
          "isHighlighted": true
        },
        {
          "title": "Comprehensive Preferences System",
          "description": "Complete preferences interface with tabbed navigation for General settings, Appearance customization, and Keyboard shortcuts management. Features live previews and comprehensive validation.",
          "isHighlighted": false
        },
        {
          "title": "Advanced Keyboard Shortcuts",
          "description": "Fully customizable keyboard shortcuts with conflict detection, import/export functionality, and comprehensive help documentation. Record new shortcuts with intuitive interface.",
          "isHighlighted": false
        },
        {
          "title": "Enhanced Appearance Controls",
          "description": "Fine-tune the app's visual appearance with glassmorphism effects, animation intensity controls, hover effects, and toolbar style options.",
          "isHighlighted": false
        },
        {
          "title": "What's New Feature",
          "description": "Stay informed about new features and improvements with automatic update notifications and on-demand access through the Help menu.",
          "isHighlighted": false
        }
      ]
    },
    {
      "title": "Improvements",
      "type": "improvements",
      "items": [
        {
          "title": "AI Features with Complete Privacy",
          "description": "All AI processing happens entirely on your Mac using Apple's Vision and Core ML. No cloud services, no data collection, no tracking. Your images never leave your device.",
          "isHighlighted": true
        },
        {
          "title": "Lightning-Fast AI Analysis",
          "description": "Optimized AI pipeline analyzes images in 1-2 seconds with intelligent caching. Background processing ensures smooth browsing while AI works. Results appear progressively as analysis completes.",
          "isHighlighted": true
        },
        {
          "title": "Improved Dark Mode Interface",
          "description": "Lighter, more pleasant background colors in preferences and throughout the app for better visibility and reduced eye strain.",
          "isHighlighted": false
        },
        {
          "title": "Enhanced User Experience",
          "description": "Comprehensive validation system with real-time feedback, smooth animations, and intuitive interface design throughout preferences.",
          "isHighlighted": false
        },
        {
          "title": "Enhanced Accessibility Support",
          "description": "Comprehensive accessibility improvements including high contrast mode compatibility and detailed accessibility hints for interactive elements.",
          "isHighlighted": false
        },
        {
          "title": "Keyboard Shortcuts",
          "description": "New and refined keyboard shortcuts for navigation, zooming, fullscreen, grid view, and slideshow controls.",
          "isHighlighted": false
        },
        {
          "title": "Faster Image Loading",
          "description": "Optimized image loading pipeline reduces wait times and improves responsiveness.",
          "isHighlighted": false
        },
        {
          "title": "Better Memory Management",
          "description": "Enhanced memory handling prevents crashes when viewing large image collections.",
          "isHighlighted": false
        },
        {
          "title": "Dark Mode Enhancements",
          "description": "Refined dark mode appearance with better contrast and visual hierarchy.",
          "isHighlighted": false
        }
      ]
    },
    {
      "title": "Bug Fixes",
      "type": "bugFixes",
      "items": [
        
        {
          "title": "Fixed Thumbnail Generation",
          "description": "Resolved issues with thumbnail generation for certain image formats.",
          "isHighlighted": false
        },
        {
          "title": "Window State Persistence",
          "description": "Fixed window size and position not being remembered between app launches.",
          "isHighlighted": false
        },
        {
          "title": "Keyboard Navigation",
          "description": "Corrected keyboard shortcuts not working in certain UI states and improved accessibility announcements.",
          "isHighlighted": false
        }
      ]
    }
  ]
}
